Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/H04A.tmx
Source language: en_us
Languages: zh_cn

source: 2010 Human Rights Report: Democratic People's Republic of Korea
zh_cn: 2010国别人权报告：朝鲜民主主义人民共和国

source: The Democratic People's Republic of Korea (DPRK or North Korea) is a dictatorship under the absolute rule of Kim Jong-il, general secretary of the Korean Workers' Party (KWP) and chairman of the National Defense Commission (NDC), the "highest office of state."
zh_cn: 朝鲜民主主义人民共和国（DPRK或朝鲜/北韩）是一个独裁政权，处于朝鲜劳动党（KWP）总书记、国防委员会（NDC）（所谓的“国家最高办公室”）主席金正日的绝对统治之下。

source: The country has an estimated population of 23.5 million.
zh_cn: 该国大约有2350万人口。

source: Kim's father, the late Kim Il-sung, remains "eternal president."
zh_cn: 金正日的父亲，已经去世的金日成，仍然是“永远的主席”。

source: National elections held in March 2009 were not free or fair.
zh_cn: 2009年进行的全国选举既不自由也不公正。

source: Security forces did not report to civilian authorities.
zh_cn: 安保机构不向文官当局报告（不对文官政府负责）。

source: Citizens did not have the right to change their government.
zh_cn: 公民无权改变政府。

source: The government subjected citizens to rigid controls over many aspects of their lives.
zh_cn: 政府将公民生活的许多方面置于严厉控制之下。

source: There continued to be reports of extrajudicial killings, disappearances, arbitrary detention, arrests of political prisoners, harsh and life-threatening prison conditions, and torture.
zh_cn: 关于非法虐杀、失踪、随意拘禁、逮捕政治犯、艰苦到威胁生命的监狱条件以及酷刑等问题的报告继续存在。

source: There continued to be reports that pregnant female prisoners underwent forced abortions in some cases, and in other cases babies were killed upon birth in prisons.
zh_cn: 在某些情况下怀孕女犯人遭受强制堕胎，在其他情况下监狱中婴儿甫一降生即被杀害，这样的报告也继续存在。

source: The judiciary was not independent and did not provide fair trials.
zh_cn: 司法机关并不独立也不进行公平的审判。

source: Citizens were denied freedom of speech, press, assembly, and association, and the government attempted to control all information.
zh_cn: 公民没有言论、新闻、集会、结社的自由，政府努力控制所有信息。

source: The government restricted freedom of religion, citizens' movement, and worker rights.
zh_cn: 政府限制宗教自由、公民运动以及工人权利。

source: There continued to be reports of severe punishment of some repatriated refugees and their family members.
zh_cn: 某些被遣返的难民及其家人遭受严厉惩罚，这样的报告继续存在。

source: There were widespread reports of trafficking in women and girls among refugees and workers crossing the border into China.
zh_cn: 难民和工人中贩卖妇女和儿童穿越国境到中国，这样的报告俯拾皆是。
